clc
clear
P=[-2.2979,-110.2170,-55.8182,-2.7337,-72.0235,-45.9883;
    -4.6346,-205.6276,-139.6364,-5.0029,-132.1760,-73.9120;
    2.9419,98.7097,37.0000,0.6898,17.8065,27.0968;
    -2.5578,-85.6070,-52.5455,-2.7795,-92.7683,-46.6158;
    -4.6510,-160.8915,-89.0909,-5.1331,-178.9883,-130.0059;
    0.6968,15.4839,24.0000,3.6387,86.3226,23.8387];

eigenvalues = sqrt(eig(P));
% 提取纯虚数特征值
pure_imaginary = eigenvalues(imag(eigenvalues) ~= 0 & real(eigenvalues) == 0);

% 提取虚部并存储到 r2
r2 = imag(pure_imaginary);

% 显示 r2 的结果
disp('Imaginary parts extracted into r2:');
disp(r2);